<a href="https://colab.research.google.com/github/orlandokohjy/PhilipCapital-test-/blob/main/PhilipCapital_(test).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
!ls

sample_data

In [4]:
from google.colab import drive
drive.mount('/gdrive')

Mounted at /gdrive

In [7]:
%cd /gdrive

/gdrive

In [33]:
# Standard import
import os as os
import pandas as pd
import numpy as np

df_people = pd.read_excel('/content/drive/Othercomputers/My MacBook Pro/KJY/Interview Test/PhilipCapital/Excel and VBA Test.xlsx', sheet_name = 'People', usecols="B:E")
df_income = pd.read_excel('/content/drive/Othercomputers/My MacBook Pro/KJY/Interview Test/PhilipCapital/Excel and VBA Test.xlsx', sheet_name = 'Median Income')

In [34]:
df_people.head()

                 Name  Age                Occupation  Yearly Income
0      Keegan Russell   40                   Cashier          15000
1  Samantha Valentine   50         Desktop publisher         102000
2       Moses Nielsen   75  Interpreter & Translator          95000
3      Savanna Walter   19                    Dancer          61000
4        Heidi Holder   23   Radiologic Technologist         129000

In [35]:
df_people.shape

(1000, 4)

In [36]:
df_income.head()

       Occupation  Median Income
0      Accountant          14000
1           Actor          15000
2         Actuary          60000
3  Anthropologist         145000
4       Architect         143000

In [37]:
# Task 1: remove duplicated row in dataframe "People"
df_people_new = df_people.drop_duplicates()

In [38]:
df_people_new.shape

(992, 4)

In [44]:
# Task 2: return a df of a list of "Dancer" aged < 50 and have a yearly income > median income for "Dancers"
merge_df = df_people_new.merge(df_income, how='left', on='Occupation')

In [42]:
desired_df = merge_df[(merge_df['Occupation'] == 'Dancer') & (merge_df['Yearly Income'] > merge_df['Median Income'])]

In [43]:
desired_df

              Name  Age Occupation  Yearly Income  Median Income
581   Kaylin Carey   29     Dancer         149000         122000
631  Jorge Robbins   68     Dancer         129000         122000
765    Damion Ball   43     Dancer         123000         122000